MirikoHi/ec2026/robot.syscfg
GPIO7.$name                              = "RELAY";
GPIO7.associatedPins[0].$name            = "Control";
GPIO7.associatedPins[0].internalResistor = "PULL_UP";
GPIO7.associatedPins[0].pin.$assign      = "PB4";

GPIO8.$name                          = "Gray_Address";
GPIO8.associatedPins.create(3);
GPIO8.associatedPins[0].$name        = "PIN_0";
GPIO8.associatedPins[0].assignedPort = "PORTA";
GPIO8.associatedPins[0].assignedPin  = "24";
GPIO8.associatedPins[1].$name        = "PIN_1";
GPIO8.associatedPins[1].assignedPort = "PORTB";
GPIO8.associatedPins[1].assignedPin  = "25";
GPIO8.associatedPins[2].$name        = "PIN_2";
GPIO8.associatedPins[2].assignedPin  = "24";
GPIO8.associatedPins[2].assignedPort = "PORTB";

GPIO9.$name                         = "User_LED";
GPIO9.port                          = "PORTB";
GPIO9.associatedPins[0].$name       = "User_led";
GPIO9.associatedPins[0].pin.$assign = "PB22";

GPIO10.$name                         = "Gray_Serial";
GPIO10.associatedPins.create(2);
GPIO10.associatedPins[0].$name       = "DAT";
GPIO10.associatedPins[0].direction   = "INPUT";
GPIO10.associatedPins[0].pin.$assign = "PA26";
GPIO10.associatedPins[1].$name       = "CLK";
GPIO10.associatedPins[1].pin.$assign = "PA27";

GPIO11.$name                          = "NRF24L";
GPIO11.port                           = "PORTB";
GPIO11.associatedPins.create(2);
GPIO11.associatedPins[0].$name        = "CSN";
GPIO11.associatedPins[0].initialValue = "SET";
GPIO11.associatedPins[0].pin.$assign  = "PB5";
GPIO11.associatedPins[1].$name        = "CE";

I2C1.$name                     = "I2C_0";
I2C1.advDigitalGlitchFilter    = "CLOCKS_1";
I2C1.advControllerRXFIFOTRIG   = "BYTES_8";
I2C1.advControllerTXFIFOTRIG   = "BYTES_7";
I2C1.enableDMAEvent1           = false;
I2C1.enableDMAEvent2           = false;
I2C1.basicEnableController     = true;
I2C1.peripheral.$assign        = "I2C0";
I2C1.sdaPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric13";
I2C1.sdaPinConfig.enableConfig = true;
I2C1.sclPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric14";
I2C1.sclPinConfig.enableConfig = true;

MCAN1.$name                = "MCAN0";
MCAN1.fdMode               = false;
MCAN1.wkupReqEnable        = true;
MCAN1.autoWkupEnable       = true;
MCAN1.emulationEnable      = true;
MCAN1.spPercent            = 80;
MCAN1.desiredNomRate       = 1000;
MCAN1.enableInterrupt      = true;
MCAN1.overrideRetention    = true;
MCAN1.interruptFlags       = ["DL_MCAN_INTERRUPT_RF0N"];
MCAN1.interruptLine        = ["DL_MCAN_INTR_LINE_NUM_1"];
MCAN1.interruptLine1Flag   = ["DL_MCAN_INTR_MASK_ALL"];
MCAN1.m0interrupts         = ["DL_MCAN_MSP_INTERRUPT_LINE1"];
MCAN1.additionalCoreConfig = true;
MCAN1.rrfe                 = true;
MCAN1.rrfs                 = true;
MCAN1.txPinConfig.$name    = "ti_driverlib_gpio_GPIOPinGeneric7";
MCAN1.rxPinConfig.$name    = "ti_driverlib_gpio_GPIOPinGeneric10";

PWM1.$name                              = "Motor";
PWM1.timerStartTimer                    = true;
PWM1.timerCount                         = 2500;
PWM1.peripheral.$assign                 = "TIMG0";
PWM1.peripheral.ccp0Pin.$assign         = "PB10";
PWM1.peripheral.ccp1Pin.$assign         = "PB11";
PWM1.PWM_CHANNEL_0.$name                = "ti_driverlib_pwm_PWMTimerCC2";
PWM1.PWM_CHANNEL_0.invert               = true;
PWM1.PWM_CHANNEL_1.$name                = "ti_driverlib_pwm_PWMTimerCC3";
PWM1.PWM_CHANNEL_1.invert               = true;
PWM1.ccp0PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric5";
PWM1.ccp0PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM1.ccp0PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM1.ccp0PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM1.ccp0PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM1.ccp1PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric6";
PWM1.ccp1PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM1.ccp1PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM1.ccp1PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM1.ccp1PinConfig.passedPeripheralType = scripting.forceWrite("Digital");

SPI1.$name                              = "ICM42688";
SPI1.polarity                           = "1";
SPI1.phase                              = "1";
SPI1.frameFormat                        = "MOTO3";
SPI1.sclkPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI1.sclkPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI1.sclkPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI1.sclkPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric2";
SPI1.mosiPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI1.mosiPinConfig.hideOutputInversion  = scripting.forceWrite(false);
SPI1.mosiPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI1.mosiPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI1.mosiPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric3";
SPI1.misoPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI1.misoPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI1.misoPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric8";
SPI1.peripheral.$assign                 = "SPI0";

SPI2.$name                              = "NRF24L01";
SPI2.frameFormat                        = "MOTO3";
SPI2.sclkPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric9";
SPI2.sclkPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI2.sclkPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI2.sclkPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI2.mosiPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric17";
SPI2.mosiPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI2.mosiPinConfig.hideOutputInversion  = scripting.forceWrite(false);
SPI2.mosiPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI2.mosiPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI2.misoPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric18";
SPI2.misoPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI2.misoPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI2.peripheral.$assign                 = "SPI1";
SPI2.peripheral.sclkPin.$assign         = "PB9";
SPI2.peripheral.mosiPin.$assign         = "PB8";
SPI2.peripheral.misoPin.$assign         = "PB21";

SYSCTL.clockTreeEn = true;

TIMER1.$name              = "TIMER_TICK";
TIMER1.timerClkDiv        = 8;
TIMER1.timerClkPrescale   = 10;
TIMER1.timerMode          = "PERIODIC";
TIMER1.timerStartTimer    = true;
TIMER1.interrupts         = ["ZERO"];
TIMER1.interruptPriority  = "3";
TIMER1.timerPeriod        = "10 ms";
TIMER1.peripheral.$assign = "TIMA0";

TIMER2.$name              = "dwt";
TIMER2.timerStartTimer    = true;
TIMER2.timerMode          = "PERIODIC_UP";
TIMER2.timerPeriod        = "53687ms";
TIMER2.peripheral.$assign = "TIMG12";

